---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointFlexibleNumParam
source: html/24c7699a-1b08-f9c3-5932-accfe3da9767.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointFlexibleNumParam Property

"Number"

## Syntax (C#)
```csharp
public static ForgeTypeId PointFlexibleNumParam { get; }
```